{
  "backend/main.mo": "Defines core data models and storage maps for videos, users, comments, playlists, and AI image saving, including image-metadata moderation before saving.",
  "backend/moderation.mo": "Provides simple keyword-based moderation for image metadata and chat messages, flagging sexually explicit content.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files describing their responsibilities and behaviors.",
  "frontend/index.css": "Defines Tailwind base layers and color variables for light and dark themes using OKLCH color values.",
  "frontend/index.html": "Main HTML entry point setting up metadata, PWA manifest links, Apple PWA support, and bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, shortcuts, and display settings.",
  "frontend/public/offline.html": "Offline fallback page displayed when network is unavailable.",
  "frontend/public/sw.js": "Service worker implementing caching, offline fallback, and cache versioning for the PWA.",
  "frontend/src/App.tsx": "Main app component handling global state, authentication, routing, and rendering pages inside AppShell.",
  "frontend/src/components/AddToPlaylistDialog.tsx": "Dialog for authenticated users to add a video to an existing playlist or create a new one.",
  "frontend/src/components/ai-studio/ImagesPicturesSection.tsx": "Main UI for generating, uploading, editing, and saving images, managing tabs and state for the AI image workflow.",
  "frontend/src/components/ai-studio/PromoCreatorCanvas.tsx": "Canvas editor that overlays text on a base image, supports erasing, downloading, and saving promo images.",
  "frontend/src/components/ai-studio/SavedImagesLibrary.tsx": "Displays saved images with options to reopen, download, and delete them using query hooks.",
  "frontend/src/components/AiEditDialog.tsx": "Dialog showing AI-generated metadata suggestions and allowing users to apply them individually or all at once.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, sidebar, footer, and main content area with navigation callbacks.",
  "frontend/src/components/CommentSection.tsx": "Comment system supporting posting, deleting, pinning, and sorting comments with authentication and subscription checks.",
  "frontend/src/components/Footer.tsx": "Footer displaying branding, an external link, and optional navigation to YouTubeMe.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling search, login/logout, subscription display, and sidebar toggling.",
  "frontend/src/components/InstallAppAction.tsx": "Renders a button or menu item to trigger PWA installation and shows iOS instructions when needed.",
  "frontend/src/components/InternetIdentityHelpDialog.tsx": "Displays a dialog explaining Internet Identity sign‑in methods with actions to continue or cancel.",
  "frontend/src/components/IosInstallInstructionsDialog.tsx": "Provides a step‑by‑step dialog for adding the PWA to an iOS home screen.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter a name and submit their initial profile.",
  "frontend/src/components/PwaInstallBanner.tsx": "Shows a dismissible bottom banner prompting users to install the PWA if eligible.",
  "frontend/src/components/Sidebar.tsx": "Sidebar navigation listing pages based on authentication and subscription state with mobile open/close behavior.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin‑only modal for configuring Stripe keys, allowed countries, and payout destination.",
  "frontend/src/components/VideoCard.tsx": "Card displaying video thumbnail, title, channel, metrics, and tags with click handlers.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance tied to the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useInstallAppEntryPoint.ts": "Hook that determines when to show an install action and triggers native PWA installation or iOS instructions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Hook managing PWA installability state using a shared store and exposing a method to trigger the install prompt.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks wrapping backend actor calls for user profiles, AI stats, purchases, chat, and other app data with caching and mutation helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles, CSS variables for light/dark themes, safe-area handling, accessibility tweaks, and mobile performance optimizations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AiChatRoomPage.tsx": "Implements the real‑time AI chat room with authentication checks, message validation, message posting, and auto‑scrolling UI.",
  "frontend/src/pages/AiGenerationPaymentCancelPage.tsx": "Shows a payment cancellation screen for AI Studio access with navigation options back to the studio or home.",
  "frontend/src/pages/AiGenerationPaymentSuccessPage.tsx": "Verifies Stripe sessions, grants AI access, and renders success or error states after payment completion.",
  "frontend/src/pages/AiStudioPage.tsx": "Provides the main AI Studio interface for generating videos or images, tracking generation time, handling purchases, and navigating to upload flow.",
  "frontend/src/pages/ChannelPage.tsx": "Handles viewing and editing a user's channel, including channel creation, updates, and listing their videos.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Displays the creator's video management dashboard with editing and viewing options, gated by authentication.",
  "frontend/src/pages/DiscoverPage.tsx": "Provides entry points to AI Studio, AI Chat Room, and an external YouTube-style site via interactive cards.",
  "frontend/src/pages/DownloadPaymentFailurePage.tsx": "Shows a payment cancellation message with navigation back to the video or home.",
  "frontend/src/pages/DownloadPaymentSuccessPage.tsx": "Verifies payment for a video download and shows success or failure status with navigation options.",
  "frontend/src/pages/HomePage.tsx": "Displays all videos or search results with loading states and entry points to AI features.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a generic payment failure message with options to return home or retry.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe payment status, updates user profile, and conditionally renders success, error, or loading states.",
  "frontend/src/pages/PlaylistDetailPage.tsx": "Loads a playlist and its videos, displays them with metadata, and handles loading and missing-playlist cases.",
  "frontend/src/pages/PlaylistsPage.tsx": "Shows user playlists, supports playlist creation via a dialog, and handles authentication and loading states.",
  "frontend/src/pages/SubscriptionPage.tsx": "Displays subscription options, checks Stripe config, and creates a checkout session for premium upgrades.",
  "frontend/src/pages/UploadPage.tsx": "Handles authenticated video uploads with metadata, trimming, thumbnail generation, and premium checks.",
  "frontend/src/pages/VideoEditPage.tsx": "Loads video metadata for editing, supports thumbnail and tag updates, and offers optional AI-generated suggestions.",
  "frontend/src/pages/VideoPlayerPage.tsx": "React page that loads a video, handles likes, views, comments, and purchase/download flow with subscription checks.",
  "frontend/src/pages/YouTubeMePage.tsx": "Static informational page describing YouTubeMe.xyz and its features as a companion frontend for metube.xyz.",
  "frontend/src/utils/aiEditHeuristics.ts": "Implements client-side heuristics to improve titles, descriptions, and tags without external AI services.",
  "frontend/src/utils/aiImageGenerator.ts": "Generates styled images on‑device using Canvas with deterministic colors, gender inference, and multiple rendering modes.",
  "frontend/src/utils/aiVideoGenerator.ts": "Creates simple client-side videos using Canvas and MediaRecorder with fallback resolution handling and background support.",
  "frontend/src/utils/canvasExport.ts": "Utility functions to export canvas content as PNG, data URLs, blob URLs, and load images from files.",
  "frontend/src/utils/chatModeration.ts": "Client-side filter that blocks chat messages containing sexually explicit keywords.",
  "frontend/src/utils/contentPolicy.ts": "Provides permissive AI generation policy utilities with no prompt blocking and a generic guideline message.",
  "frontend/src/utils/download.ts": "Provides helpers to download blobs, data URLs, and images as PNG files and includes filename sanitization and timestamped filename generation.",
  "frontend/src/utils/fetchImageFromUrl.ts": "Fetches and validates remote images over HTTP/HTTPS, ensuring correct content type and loading them into an HTMLImageElement.",
  "frontend/src/utils/networkGuards.ts": "Defines local‑only operation guards and markers to ensure no external AI API calls occur, especially for image generation.",
  "frontend/src/utils/uploadModeration.ts": "Checks upload metadata for sexually explicit keywords and blocks uploads containing restricted terms.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and applying plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project state, architectural notes, known issues, branding changes, and a list of existing features for MeTube/MeTube AI Studios."
}