{
  "backend/main.mo": "Defines backend actor with types and maps for users, videos, comments, playlists, AI features, and includes image-saving logic with access control.",
  "feature_evidence.json": "Describes feature evidence for updates removing keyword-based AI content blocks and adjusting related UI and utility files.",
  "frontend-file-summaries.txt": "Lists concise summaries of major frontend files covering navigation, pages, components, hooks, and styling.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "HTML entry point loading the React app and favicon.",
  "frontend/src/App.tsx": "Main React app handling routing, auth, page state, payment callbacks, and rendering core pages inside AppShell.",
  "frontend/src/components/AddToPlaylistDialog.tsx": "Modal dialog allowing users to add a video to existing playlists or create new ones, with auth checks and mutation hooks.",
  "frontend/src/components/ai-studio/ImagesPicturesSection.tsx": "Manages AI image generation, uploading, promo editing, and saved image library interactions within tabbed views.",
  "frontend/src/components/ai-studio/PromoCreatorCanvas.tsx": "Offers a canvas-based promo editor allowing text overlays, erasing, downloading, and saving composed images.",
  "frontend/src/components/ai-studio/SavedImagesLibrary.tsx": "Shows saved promo images with metadata, supports reopening images for editing, and allows deletion.",
  "frontend/src/components/AiEditDialog.tsx": "Dialog UI that displays AI-generated title, description, and tag suggestions and lets users apply them individually or all at once.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, sidebar, footer, and main content region with navigation handlers.",
  "frontend/src/components/CommentSection.tsx": "Handles displaying, adding, deleting, and pinning comments with auth, subscription checks, and moderation controls.",
  "frontend/src/components/Footer.tsx": "Footer showing branding, a caffeine.ai link, and optional navigation to YouTubeMe.",
  "frontend/src/components/Header.tsx": "Top navigation bar with login/logout via Internet Identity, search handling, and navigation controls.",
  "frontend/src/components/InternetIdentityHelpDialog.tsx": "Modal explaining Internet Identity sign‑in and providing a continue/cancel flow before login.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to enter their name and save an initial profile.",
  "frontend/src/components/Sidebar.tsx": "Renders a navigational sidebar showing various pages based on authentication and subscription state, with responsive mobile behavior.",
  "frontend/src/components/StripeSetupModal.tsx": "Provides an admin-only modal for configuring Stripe keys and allowed countries, followed by payout destination setup.",
  "frontend/src/components/VideoCard.tsx": "Displays a video thumbnail card with title, uploader, views, likes, and tags, and handles video and channel click events.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading and managing user identities and login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, AI stats, payments, chat messages, and other backend data.",
  "frontend/src/index.css": "Applies Tailwind base styles and defines light/dark theme CSS variables for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AiChatRoomPage.tsx": "Implements a real-time AI chat room UI with message sending, authentication checks, and auto-scrolling.",
  "frontend/src/pages/AiGenerationPaymentCancelPage.tsx": "Shows a cancellation notice for AI Studio payments with navigation buttons.",
  "frontend/src/pages/AiGenerationPaymentSuccessPage.tsx": "Verifies payment success, handles errors, and displays activated AI Studio features.",
  "frontend/src/pages/AiStudioPage.tsx": "AI video and image generation page handling user auth, generation limits, and creation workflow with background images and resolution settings.",
  "frontend/src/pages/ChannelPage.tsx": "Displays a user's channel, videos, and allows creating or editing channel details if owned by the viewer.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Authenticated creator dashboard for viewing, managing, and editing the user's uploaded videos.",
  "frontend/src/pages/DiscoverPage.tsx": "Landing page offering navigation to AI Studio, AI chat room, and an external YouTube-like interface.",
  "frontend/src/pages/DownloadPaymentFailurePage.tsx": "Shows a cancelled payment message with options to return to the video or home.",
  "frontend/src/pages/DownloadPaymentSuccessPage.tsx": "Verifies a completed payment and grants download access, displaying success or error states.",
  "frontend/src/pages/HomePage.tsx": "Fetches and displays videos with search support, loading states, and links to AI tools. Sorts videos by date and renders cards or empty-state messages.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment-cancelled message with options to return home or retry checkout.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies a Stripe session, updates subscription status, and displays success or error states. Handles loading and error messaging during verification.",
  "frontend/src/pages/PlaylistDetailPage.tsx": "Loads a playlist and its videos, showing loading, empty, or populated states with navigation. Filters all videos to only those in the playlist.",
  "frontend/src/pages/PlaylistsPage.tsx": "Displays and manages user playlists with creation dialog, authentication checks, and loading states.",
  "frontend/src/pages/SubscriptionPage.tsx": "Shows subscription options, verifies Stripe config, and initiates checkout for premium access.",
  "frontend/src/pages/UploadPage.tsx": "Video upload page handling file selection, trimming, metadata entry, and submission with progress and AI prefill support.",
  "frontend/src/pages/VideoEditPage.tsx": "Video metadata editor allowing title, description, tags, and thumbnail updates with optional AI-based suggestions.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Video playback page with views, likes, comments, purchase flow, and download functionality.",
  "frontend/src/pages/YouTubeMePage.tsx": "Static informational page explaining YouTubeMe.xyz features and integration with metube.xyz.",
  "frontend/src/utils/aiEditHeuristics.ts": "Local heuristics for improving titles, descriptions, and tags by formatting text and extracting keywords.",
  "frontend/src/utils/aiImageGenerator.ts": "Client-side deterministic image generator using canvas with multiple styles and simulated progress.",
  "frontend/src/utils/aiVideoGenerator.ts": "Generates a client-side WebM video using Canvas and MediaRecorder with resolution caps and fallback logic, rendering text and optional background images. Returns a File, preview URL, and metadata.",
  "frontend/src/utils/canvasExport.ts": "Provides helpers to export canvases as PNG files, data URLs, blob URLs, and load images from File objects.",
  "frontend/src/utils/contentPolicy.ts": "Implements minimal local content policy checks, always allowing text but returning generic guideline messages.",
  "frontend/src/utils/fetchImageFromUrl.ts": "Fetches and validates remote images via CORS with URL checks, content-type validation, and image decoding before returning a FetchedImage.",
  "frontend/src/utils/networkGuards.ts": "Defines local-only network guard stubs that log operations and allow validation of no external API calls.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL or session-based parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with custom colors, typography, container settings, animations, and plugin integration.",
  "project_state.json": "Stores project state, scope decisions, architectural notes, and existing feature definitions for MeTube/MeTube AI Studios."
}