{
  "backend/main.mo": "Defines core backend actor with types and state maps for videos, users, playlists, comments, AI generation, and saved images plus save/get operations with access control.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs for updating YouTubeMe.co references to YouTubeMe.xyz.",
  "frontend-file-summaries.txt": "Aggregated summaries describing functionality of all major frontend components, pages, hooks, and UI elements.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, light/dark themes, and base styles.",
  "frontend/index.html": "Root HTML document setting favicon, meta tags, title, and mounting the React app.",
  "frontend/src/App.tsx": "Main React app managing routing, authentication, user profile loading, payment callback handling, and overall page state.",
  "frontend/src/components/AddToPlaylistDialog.tsx": "Dialog component allowing authenticated users to add a video to existing or newly created playlists with create-and-add support.",
  "frontend/src/components/ai-studio/ImagesPicturesSection.tsx": "AI Studio section for generating, uploading, editing, and saving images, integrating generation API, promo editor, and saved image library.",
  "frontend/src/components/ai-studio/PromoCreatorCanvas.tsx": "Canvas-based promo editor allowing text overlays, erasing, downloading, and saving composed images with metadata.",
  "frontend/src/components/ai-studio/SavedImagesLibrary.tsx": "Displays saved promo images with metadata, supports reopening images in the editor and deleting them.",
  "frontend/src/components/AiEditDialog.tsx": "Dialog component showing AI-generated title, description, and tag suggestions with options to apply individual or all changes.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, sidebar, footer, and main content area with navigation handlers.",
  "frontend/src/components/CommentSection.tsx": "Renders comments, handles posting, deleting, and pinning comments with subscription and authentication checks.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution, link to caffeine.ai, and an optional navigation button.",
  "frontend/src/components/Header.tsx": "Top navigation bar with branding, search, authentication controls, and subscription status display.",
  "frontend/src/components/InternetIdentityHelpDialog.tsx": "Dialog explaining Internet Identity login flow and offering a continue or cancel option.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting users to enter their name and save their initial profile.",
  "frontend/src/components/Sidebar.tsx": "Sidebar component that renders navigation buttons based on authentication, subscription status, and current page, with mobile open/close behavior.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe payments, handling secret key setup and payout destination submission.",
  "frontend/src/components/VideoCard.tsx": "Displays a video thumbnail, title, uploader, views, likes, and tags, with click actions for opening the video or channel.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication, managing identity loading, login, logout, and status tracking via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, AI generation stats, purchases, and other backend interactions using the actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AiChatRoomPage.tsx": "Implements a real-time AI chat room UI with message display and message posting.",
  "frontend/src/pages/AiGenerationPaymentCancelPage.tsx": "Displays a cancellation notice for failed AI generation payments with navigation options.",
  "frontend/src/pages/AiGenerationPaymentSuccessPage.tsx": "Verifies payment success and shows success or error messaging with navigation actions.",
  "frontend/src/pages/AiStudioPage.tsx": "Page for generating AI videos/images with user-provided text, background images, and generation time limits, including purchase checks and navigation to upload.",
  "frontend/src/pages/ChannelPage.tsx": "Displays a user's channel and videos, with options to create or edit a channel if owned by the logged-in user.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Creator dashboard showing the authenticated user's videos with editing and navigation options.",
  "frontend/src/pages/DiscoverPage.tsx": "Landing page highlighting AI Studio, AI Chat Room, and YouTubeMe.xyz with navigation buttons.",
  "frontend/src/pages/DownloadPaymentFailurePage.tsx": "Informs the user that a video download payment was cancelled and provides navigation back to the video or home.",
  "frontend/src/pages/DownloadPaymentSuccessPage.tsx": "Verifies a completed video download purchase and shows success or error states with navigation options.",
  "frontend/src/pages/HomePage.tsx": "Home page that fetches and displays videos, supports search mode, loading states, and entry cards for AI Studio and AI Chat Room.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment cancelled message with options to return home or retry.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies a Stripe payment session, updates subscription state, and displays success or error feedback.",
  "frontend/src/pages/PlaylistDetailPage.tsx": "Loads a playlist and its associated videos, handling loading, not-found, and empty states.",
  "frontend/src/pages/PlaylistsPage.tsx": "Displays user playlists with creation dialog, handling authentication and loading states.",
  "frontend/src/pages/SubscriptionPage.tsx": "Shows subscription plans, checks Stripe config, and initiates checkout for Premium upgrades.",
  "frontend/src/pages/UploadPage.tsx": "Video upload form supporting metadata entry, trimming, thumbnails, tags, and progress tracking with optional AI-studio prefilled inputs.",
  "frontend/src/pages/VideoEditPage.tsx": "Video metadata editor allowing title, description, tags, thumbnail updates, and AI-based suggestion generation.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Video playback page with likes, views, comments, entitlement checks, purchasing, and download functionality.",
  "frontend/src/pages/YouTubeMePage.tsx": "Static informational page describing YouTubeMe.xyz features, integration, and purpose.",
  "frontend/src/utils/aiEditHeuristics.ts": "Local heuristic functions that improve titles, descriptions, and tags and generate AI-style edit suggestions.",
  "frontend/src/utils/aiImageGenerator.ts": "Client-side deterministic image generator using canvas with multiple styles and simulated progress.",
  "frontend/src/utils/aiVideoGenerator.ts": "Generates WebM videos client‑side using Canvas and MediaRecorder with resolution caps, fallbacks, and optional background images.",
  "frontend/src/utils/canvasExport.ts": "Provides utilities to export a canvas to PNG, get data/blob URLs, and load images from file blobs.",
  "frontend/src/utils/contentPolicy.ts": "Implements local keyword‑based detection of explicit content and returns standardized policy messages.",
  "frontend/src/utils/fetchImageFromUrl.ts": "Fetches and validates remote images with URL checks, CORS handling, and blob-to-image loading.",
  "frontend/src/utils/networkGuards.ts": "Contains local‑only operation guards and a stub validator ensuring no external AI API calls occur.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL parameters with session persistence and hash‑routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Captures project state, scope changes, feature notes, and architectural constraints for MeTube/MeTube AI Studios."
}