{
  "backend/main.mo": "Motoko backend defining video, user, playlist, and AI-studio image types plus maps for storage, with initial logic for saving and retrieving user-owned saved images using access control.",
  "feature_evidence.json": "Feature evidence report listing AI‑studio image workflow, client‑side generation, and backend persistence features with related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries for all frontend files describing their roles in navigation, UI, hooks, and new AI‑studio image features.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light and dark themes and applying global background and text styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx with favicon and meta tags.",
  "frontend/src/App.tsx": "Main React app handling routing, authentication, Stripe checks, page rendering, and global state such as search, selected items, and sidebar state.",
  "frontend/src/components/AddToPlaylistDialog.tsx": "Dialog component allowing authenticated users to add a video to an existing or newly created playlist with creation and mutation hooks.",
  "frontend/src/components/ai-studio/ImagesPicturesSection.tsx": "AI Studio section managing image generation, upload, promo editing, and library saving with tabbed UI.",
  "frontend/src/components/ai-studio/PromoCreatorCanvas.tsx": "Canvas tool for composing promo images with text, erasing, downloading, and saving functionality.",
  "frontend/src/components/ai-studio/SavedImagesLibrary.tsx": "Displays saved promo images with previews, tags, delete actions, and the ability to reopen images for editing.",
  "frontend/src/components/AiEditDialog.tsx": "Renders a dialog showing AI-generated title, description, and tag suggestions and lets users apply them individually or all at once.",
  "frontend/src/components/AppShell.tsx": "Provides the main layout with header, sidebar, footer, and content area, wiring navigation and search props throughout.",
  "frontend/src/components/CommentSection.tsx": "Manages displaying, adding, deleting, and pinning comments with authentication and subscription checks, including sorting pinned comments first.",
  "frontend/src/components/Footer.tsx": "Displays a footer with branding, a caffeine.ai link, and an optional navigation button to YouTubeMe.",
  "frontend/src/components/Header.tsx": "Renders the top navigation bar with search, authentication via Internet Identity, navigation controls, and subscription indicators.",
  "frontend/src/components/InternetIdentityHelpDialog.tsx": "Shows a help dialog explaining Internet Identity sign-in methods and allows users to continue or cancel login.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal requesting the user’s name and saves the initial profile with default subscription status.",
  "frontend/src/components/Sidebar.tsx": "Sidebar component showing navigation buttons based on authentication, subscription status, and current page, with mobile toggle handling.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe keys and allowed countries, followed by optional payout destination setup.",
  "frontend/src/components/VideoCard.tsx": "Displays a video thumbnail, title, uploader, stats, and tags, with click handlers for video and channel navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing identity loading, login, and logout using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as profiles, AI stats, purchases, and chat messages.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AiChatRoomPage.tsx": "Displays a real-time AI chat room where authenticated users can view and send messages.",
  "frontend/src/pages/AiGenerationPaymentCancelPage.tsx": "Shows a cancellation notice for AI Studio payment with navigation options.",
  "frontend/src/pages/AiGenerationPaymentSuccessPage.tsx": "Verifies a Stripe session and shows success or error UI for AI Studio purchase activation.",
  "frontend/src/pages/AiStudioPage.tsx": "AI Studio UI for generating videos or images with quotes, backgrounds, time limits, and purchase checks.",
  "frontend/src/pages/ChannelPage.tsx": "Displays a user's channel and videos with options to create or edit channel details.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Authenticated creator dashboard showing uploaded videos with management and navigation options.",
  "frontend/src/pages/DiscoverPage.tsx": "Discover hub linking to AI Studio, AI Chat Room, and an external YouTube‑style site.",
  "frontend/src/pages/DownloadPaymentFailurePage.tsx": "Shows a payment‑cancelled message with navigation back to the video or home.",
  "frontend/src/pages/DownloadPaymentSuccessPage.tsx": "Verifies purchase on load and shows success or error status with navigation options.",
  "frontend/src/pages/HomePage.tsx": "Displays all videos or search results with loading states, empty states, and links to AI Studio and AI Chat Room.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment-cancelled message with options to return home or retry checkout.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe payment status, updates user subscription, and shows success or failure states.",
  "frontend/src/pages/PlaylistDetailPage.tsx": "Fetches a playlist and displays its videos with loading and empty states, including navigation back to playlists.",
  "frontend/src/pages/PlaylistsPage.tsx": "Lists the user's playlists, supports creating new ones, and handles unauthenticated and loading states.",
  "frontend/src/pages/SubscriptionPage.tsx": "Shows subscription options, checks Stripe configuration, and starts a checkout session for premium access.",
  "frontend/src/pages/UploadPage.tsx": "Upload page for selecting videos, trimming, adding metadata, and submitting uploads with progress tracking.",
  "frontend/src/pages/VideoEditPage.tsx": "Video editing page allowing metadata updates, thumbnail changes, tag management, and AI-based edit suggestions.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Video playback page showing video details, comments, likes, view tracking, and purchase/download options.",
  "frontend/src/pages/YouTubeMePage.tsx": "Static informational page describing the YouTubeMe.co platform and its features.",
  "frontend/src/utils/aiEditHeuristics.ts": "Implements simple local heuristics to auto-improve titles, descriptions, and tags for videos.",
  "frontend/src/utils/aiImageGenerator.ts": "Client-side canvas-based pseudo-AI image generator supporting multiple styles and progress updates.",
  "frontend/src/utils/aiVideoGenerator.ts": "Generates WebM videos client‑side using Canvas and MediaRecorder with resolution capping and fallback handling.",
  "frontend/src/utils/canvasExport.ts": "Provides helpers to export a canvas as PNG, get data URLs/blob URLs, and load images from files.",
  "frontend/src/utils/contentPolicy.ts": "Checks text for blocked explicit-content keywords and returns policy messages.",
  "frontend/src/utils/fetchImageFromUrl.ts": "Fetches and validates remote images via CORS, ensuring proper URL format and image content type.",
  "frontend/src/utils/networkGuards.ts": "Local-only operation guards that log and optionally validate absence of external network calls.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, animations, container settings, and plugin setup.",
  "project_state.json": "Project state metadata describing MeTube features, scope, policies, and architectural notes."
}