{
  "kind": "build_request",
  "title": "Add a clearer in-app “Install App” entry point for the metube.xyz PWA (with iOS fallback instructions)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-67",
      "text": "Add a clearly visible in-app “Install App” button entry point that complements the existing PWA install banner, so mobile users can intentionally trigger installation from within the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "If you want, I can also add a simple “Install App” button inside the UI to make it even clearer for mobile users.",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "When the app is not installed and installation is available, the UI shows an “Install App” action in a discoverable location (e.g., header overflow/menu, sidebar, or footer).",
        "Clicking “Install App” triggers the native install prompt on browsers that support `beforeinstallprompt`.",
        "The “Install App” action is hidden/disabled when the app is already installed (standalone display mode).",
        "All user-facing text is in English and uses the metube.xyz name."
      ]
    },
    {
      "id": "REQ-68",
      "text": "Implement an iOS/Safari-friendly fallback for installation where the native install prompt is not available: show an in-app modal (or equivalent) with step-by-step English instructions to add metube.xyz to the home screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "You can install it by adding metube.xyz to your home screen, because the site now works as a full PWA.",
          "If you want, I can also add a simple “Install App” button inside the UI to make it even clearer for mobile users."
        ]
      },
      "acceptanceCriteria": [
        "On platforms where `beforeinstallprompt` is not available but the app is not installed, clicking “Install App” shows an instruction UI rather than doing nothing.",
        "The instruction UI includes clear steps (e.g., “Open the Share menu” → “Tap ‘Add to Home Screen’”).",
        "The instruction UI can be dismissed and does not block normal navigation."
      ]
    },
    {
      "id": "REQ-69",
      "text": "Ensure the existing PWA install banner and the new “Install App” entry point do not conflict: avoid showing redundant prompts at the same time and ensure dismissing one does not break the other.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "If the user dismisses the install banner, the separate “Install App” entry point still works.",
        "If the user installs the app successfully, both the banner and the “Install App” entry point stop appearing without requiring a refresh.",
        "No console errors occur when interacting with either install surface."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui must not be edited (compose instead).",
    "Keep the existing PWA infrastructure (manifest, service worker, offline page) intact; only add/adjust UI entry points and related client-side logic as needed.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not add Google sign-in or any third-party authentication; keep Internet Identity as the only auth method.",
    "Do not implement native mobile apps (iOS/Android); this work is strictly for the existing PWA.",
    "Do not change backend logic or introduce new backend APIs for installation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}