{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rename YouTubeMe.co to YouTubeMe.xyz across companion experience UI",
  "requirements": [
    {
      "id": "REQ-48",
      "summary": "Replace all user-facing “YouTubeMe.co” labels and links with “YouTubeMe.xyz” across Discover, footer CTA, and the YouTubeMe informational page.",
      "acceptanceCriteria": [
        "On the Discover page, the companion card title and button text say “YouTubeMe.xyz” (not “YouTubeMe.co”).",
        "On the Discover page, the companion card opens https://YouTubeMe.xyz (not https://YouTubeMe.co).",
        "In the Discover page “What’s New” list, any mention of “YouTubeMe.co” is replaced with “YouTubeMe.xyz”.",
        "In the footer, the optional CTA button label reads “YouTubeMe.xyz”.",
        "On the YouTubeMe informational page, the heading and all body copy refer to “YouTubeMe.xyz” and the external link points to https://YouTubeMe.xyz.",
        "No remaining user-visible text in the frontend references “YouTubeMe.co”."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DiscoverPage.tsx",
          "operation": "modify",
          "description": "Update the companion-experience card title and button label from “YouTubeMe.co” to “YouTubeMe.xyz”; update the click handler to open https://YouTubeMe.xyz; update the “What’s New” bullet text to reference “YouTubeMe.xyz”."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update the optional footer CTA button label from “YouTubeMe.co” to “YouTubeMe.xyz” while keeping the existing navigation behavior unchanged."
        },
        {
          "path": "frontend/src/pages/YouTubeMePage.tsx",
          "operation": "modify",
          "description": "Update the page heading and all body copy to refer to “YouTubeMe.xyz” (not “YouTubeMe.co”), including section titles and CTA text; update the external link href to https://YouTubeMe.xyz and ensure the CTA button text also reads “YouTubeMe.xyz”."
        }
      ]
    }
  ]
}