{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add an in-app Install App action with iOS fallback instructions for metube.xyz PWA",
  "requirements": [
    {
      "id": "REQ-67",
      "summary": "Add a discoverable in-app “Install App” action that triggers the native install prompt when available and hides when already installed.",
      "acceptanceCriteria": [
        "When the app is not installed and installation is available, the UI shows an “Install App” action in a discoverable location (e.g., header overflow/menu, sidebar, or footer).",
        "Clicking “Install App” triggers the native install prompt on browsers that support `beforeinstallprompt`.",
        "The “Install App” action is hidden/disabled when the app is already installed (standalone display mode).",
        "All user-facing text is in English and uses the metube.xyz name."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InstallAppAction.tsx",
          "operation": "create",
          "description": "Create a reusable Install App UI action (button/menu-row style) that uses shared install state to (a) trigger the native install prompt when available and (b) defer to iOS instructions when not. Keep all user-facing text in English and reference metube.xyz."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Wire the new Install App action into a highly discoverable location in the header (e.g., right-side action group) and ensure it is hidden/disabled when the app is already installed."
        },
        {
          "path": "frontend/src/components/Sidebar.tsx",
          "operation": "modify",
          "description": "Add an “Install App” navigation/action item in the sidebar (visible only when not installed) to provide an additional discoverable entry point on mobile."
        },
        {
          "path": "frontend/src/hooks/usePwaInstallPrompt.ts",
          "operation": "modify",
          "description": "Refactor to a shared/singleton store so multiple UI surfaces (banner + install action) observe the same installability/installed state, and so triggering the prompt works reliably from the in-app action."
        }
      ]
    },
    {
      "id": "REQ-68",
      "summary": "Provide an iOS/Safari fallback modal with step-by-step Add to Home Screen instructions when the native install prompt is unavailable.",
      "acceptanceCriteria": [
        "On platforms where `beforeinstallprompt` is not available but the app is not installed, clicking “Install App” shows an instruction UI rather than doing nothing.",
        "The instruction UI includes clear steps (e.g., “Open the Share menu” → “Tap ‘Add to Home Screen’”).",
        "The instruction UI can be dismissed and does not block normal navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/IosInstallInstructionsDialog.tsx",
          "operation": "create",
          "description": "Create a dismissible modal/dialog component with step-by-step English instructions for installing metube.xyz on iOS Safari (Share button → Add to Home Screen). Use existing UI primitives from frontend/src/components/ui (compose only; do not modify)."
        },
        {
          "path": "frontend/src/hooks/useInstallAppEntryPoint.ts",
          "operation": "create",
          "description": "Add a small composition hook that determines (1) whether to show the Install App action, (2) whether to call the native prompt, and (3) when to open the iOS instructions dialog based on install prompt availability and standalone display mode."
        },
        {
          "path": "frontend/src/components/InstallAppAction.tsx",
          "operation": "modify",
          "description": "Wire the iOS instructions dialog into the Install App action so that on platforms without `beforeinstallprompt` (and not installed), clicking “Install App” opens the instruction UI instead of doing nothing."
        }
      ]
    },
    {
      "id": "REQ-69",
      "summary": "Prevent conflicts between the existing PWA install banner and the new Install App entry point; ensure dismissal/install updates both without errors.",
      "acceptanceCriteria": [
        "If the user dismisses the install banner, the separate “Install App” entry point still works.",
        "If the user installs the app successfully, both the banner and the “Install App” entry point stop appearing without requiring a refresh.",
        "No console errors occur when interacting with either install surface."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PwaInstallBanner.tsx",
          "operation": "modify",
          "description": "Adjust banner dismissal behavior so dismissing the banner hides only the banner surface (not the underlying install prompt availability), ensuring the separate Install App entry point still works. Also ensure banner reacts immediately to successful installation state changes."
        },
        {
          "path": "frontend/src/hooks/usePwaInstallPrompt.ts",
          "operation": "modify",
          "description": "Ensure the shared install store updates all subscribers on `appinstalled` and standalone display-mode detection changes, so the banner and Install App action both stop appearing immediately after installation without requiring a refresh. Add defensive checks to avoid console errors when prompt is unavailable."
        },
        {
          "path": "frontend/src/components/InstallAppAction.tsx",
          "operation": "modify",
          "description": "Ensure the Install App action listens to the shared installed/installable state so it disappears immediately after install, and gracefully handles cases where prompt state changes (e.g., banner dismissed, prompt consumed) without console errors."
        }
      ]
    }
  ]
}