{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove adult-keyword blocking in MeTube AI Studios prompts",
  "requirements": [
    {
      "id": "REQ-49",
      "summary": "Remove keyword-based blocking so prompts containing adult/sexual terms (e.g., \"sex\") do not prevent AI video generation.",
      "acceptanceCriteria": [
        "In MeTube AI Studios > Video Generation, entering a prompt that contains the word \"sex\" does not block generation and does not show the current prohibited-content error toast.",
        "Video generation proceeds normally (subject to authentication and remaining generation time limits) even if the prompt contains previously-blocked keywords."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AiStudioPage.tsx",
          "operation": "modify",
          "description": "Remove the pre-generation hard stop that calls containsBlockedContent(quote) and shows the prohibited-content toast; generation should proceed normally while keeping existing authentication and remaining-time checks intact."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Update AI Studio content policy UI/copy so it no longer claims generation will be blocked by keyword detection for porn/explicit terms.",
      "acceptanceCriteria": [
        "The Video Generation card no longer displays messaging that says prompts will be rejected due to banned keywords.",
        "All updated user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AiStudioPage.tsx",
          "operation": "modify",
          "description": "Update the Video Generation card's Content Policy alert copy to remove statements about banned keywords being rejected/blocked; keep copy in English and align it with the updated non-keyword-blocking behavior."
        },
        {
          "path": "frontend/src/utils/contentPolicy.ts",
          "operation": "modify",
          "description": "Update any user-facing message helpers (e.g., getContentPolicyMessage/getContentPolicyNote) so they do not claim prompts are rejected due to prohibited terms/keyword detection."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Adjust the local content policy utility so it no longer implements or exposes a hard-blocking adult/sexual keyword rule for AI generation.",
      "acceptanceCriteria": [
        "The app no longer uses the existing blocked-keywords list to prevent AI generation based on adult/sexual terms.",
        "No runtime errors occur from removing/adjusting the content policy helper usage in MeTube AI Studios."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/contentPolicy.ts",
          "operation": "modify",
          "description": "Remove or neutralize the adult/sexual BLOCKED_KEYWORDS-based detection (e.g., eliminate the list and ensure containsBlockedContent no longer treats words like \"sex\" as prohibited) while preserving a safe, non-breaking API shape for any remaining imports."
        },
        {
          "path": "frontend/src/pages/AiStudioPage.tsx",
          "operation": "modify",
          "description": "Remove now-unneeded imports/usages of contentPolicy blocking helpers (containsBlockedContent/getContentPolicyMessage) so there are no runtime or build errors after the utility is adjusted."
        }
      ]
    }
  ]
}